package com.teachmeskills.lesson_5.task_3;

/**
 *  Задание 3. (Дополнительное задание)
 *    Создать класс, описывающий банкомат.
 *    1)Набор купюр, находящихся в банкомате должен задаваться тремя свойствами:
 *    количеством купюр номиналом 20, 50 и 100.
 *    2)Создать конструктор с тремя параметрами - количеством купюр каждого номинала.
 *    3)Сделать методы для добавления денег в банкомат.
 *    4)Сделать функцию, снимающую деньги, которая принимает сумму денег,
 *      а возвращает булевое значение - успешность выполнения операции.
 *    5)При снятии денег функция должна распечатывать каким количеством купюр какого номинала выдаётся сумма.
 */

public class Test {

    public static void main(String[] args) {
        ATM atm = new ATM(5, 7, 8);

        System.out.println("_______________");
        atm.getATMInfo();

        System.out.println("_______________");
        atm.withdrawCash(120);

        System.out.println("_______________");
        atm.getATMInfo();

        System.out.println("_______________");
        atm.withdrawCash(978);

        System.out.println("_______________");
        atm.getATMInfo();

        System.out.println("_______________");
        atm.addBanknote(10,10,10);

        System.out.println("_______________");
        atm.getATMInfo();
    }
}

